app/controllers/suscriptors_controller.rb

SELECT "suscriptors".* FROM "suscriptors"
---
  def index
    @suscriptors = Suscriptor.all

INSERT INTO "suscriptors" ("nombre", "apellido", "correo", "telefono", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @suscriptor = Suscriptor.new(suscriptor_params)

    respond_to do |format|
      if @suscriptor.save

DELETE FROM "suscriptors" WHERE "suscriptors"."id" = ?  [["id", 1]]
---
  def destroy
    @suscriptor.destroy

SELECT "suscriptors".* FROM "suscriptors" WHERE "suscriptors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_suscriptor
      @suscriptor = Suscriptor.find(params[:id])